Revit 2024 API
BasicLossFactor Members
The BasicLossFactor type exposes the following members.
Constructors
Name | Description
BasicLossFactor()
 Creates a basic loss factor object with no loss.
BasicLossFactor(Double)
 Creates a basic loss factor object with the given value.
BasicLossFactor(BasicLossFactor)
 Creates a copy of the given basic loss factor object
Methods
Name | Description
Clone
 Creates a copy of the LossFactor derived object.
 (Inherited from LossFactor.)
Dispose |  (Inherited from LossFactor.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from LossFactor.)
LossFactor
 The loss factor.
LossFactorValue
 The calculated loss factor value
 (Inherited from LossFactor.)
See Also
BasicLossFactor Class
Autodesk.Revit.DB.Lighting Namespace